

Процедура ПреобразованиеДанных() Экспорт 
	
	// генерим параметры	
	Файл = Новый Файл(ПолноеИмяФайла);
	ИмяФайла  = ПолучитьИмяВременногоФайла(Файл.Расширение);  
	
	// получаем & записываем  из Временного Хранилища	
	ПолучитьИзВременногоХранилища(РазмещениеДанных).Записать(ИмяФайла); 
	
	// читаем
	ТабДок.Прочитать(ИмяФайла,СпособЧтенияЗначенийТабличногоДокумента.Значение); 
	
	
КонецПроцедуры  


Процедура АнализДанных() Экспорт
	
	// страхуемся от возможного перевыбора Документа-источника
	ДоступныеЛисты.Очистить();  
	
	// Список Листов → ДоступныеЛисты
	Для каждого Лист Из ТабДок.Области Цикл
		
		ДоступныеЛисты.Добавить(Лист.Имя);	
		
	КонецЦикла;
	
	
КонецПроцедуры


Процедура ПрочитатьДанныеЛиста()Экспорт
	
	ДанныеЛиста = ТабДок.ПолучитьОбласть(ВыбранныйЛист);
	
КонецПроцедуры


Процедура ПолучитьРазмерЛиста()Экспорт

	ТекстСообщения= СтрШаблон("Количество строк :  %1
							  |Количество колонок : %2",
	ДанныеЛиста.ПолучитьРазмерОбластиДанныхПоВертикали(),
	ДанныеЛиста.ПолучитьРазмерОбластиДанныхПоГоризонтали());


КонецПроцедуры

